tap "nikitabobko/tap"
tap "riscv/riscv"
brew "ast-grep"
brew "bat"
brew "bear"
brew "btop"
brew "chafa"
brew "cmake"
brew "cmatrix"
brew "compiledb"
brew "cowsay"
brew "dysk"
brew "openjdk"
brew "emscripten"
brew "fastfetch"
brew "fd"
brew "fortune"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gdb"
brew "gh"
brew "go"
brew "gradle"
brew "imagemagick"
brew "lazygit"
brew "lilypond"
brew "lsd"
brew "luarocks"
brew "neovim"
brew "qemu"
brew "ripgrep"
brew "riscv64-elf-gdb"
brew "rust"
brew "rustup"
brew "sfml"
brew "starship"
brew "stow"
brew "tbb"
brew "tldr"
brew "tmux"
brew "tree-sitter-cli"
brew "uv"
brew "webpack"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "riscv/riscv/riscv-tools"
cask "nikitabobko/tap/aerospace"
cask "anki"
cask "claude-code"
cask "clion"
cask "cursor"
cask "discord"
cask "docker-desktop"
cask "firefox"
cask "frescobaldi"
cask "ghostty"
cask "google-chrome"
cask "intellij-idea"
cask "mixxx"
cask "musescore"
cask "obsidian"
cask "ticktick"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"
vscode "christian-kohler.path-intellisense"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "inci-august.august-themes"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "vscodevim.vim"
