tap "nikitabobko/tap"
tap "riscv/riscv"
brew "ast-grep"
brew "bat"
brew "btop"
brew "cmatrix"
brew "openjdk"
brew "emscripten"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gawk"
brew "go"
brew "gradle"
brew "lazygit"
brew "lsd"
brew "luarocks"
brew "neovim"
brew "qemu"
brew "ripgrep"
brew "riscv64-elf-gdb"
brew "starship"
brew "stow"
brew "tldr"
brew "tree-sitter-cli"
brew "uv"
brew "webpack"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "riscv/riscv/riscv-tools"
cask "aerospace"
cask "clion"
cask "cursor"
cask "discord"
cask "docker-desktop"
cask "firefox"
cask "ghostty"
cask "google-chrome"
cask "intellij-idea"
cask "obsidian"
cask "ticktick"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"
vscode "christian-kohler.path-intellisense"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "inci-august.august-themes"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
