brew "bat"
brew "btop"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "lsd"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tldr"
brew "uv"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "docker"
cask "firefox"
cask "ghostty"
cask "obsidian"
cask "ticktick"
cask "visual-studio-code"
vscode "christian-kohler.path-intellisense"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "inci-august.august-themes"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
